In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={'Name':['Ram','Sita','Laxman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}

pd.DataFrame(dict1)

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [3]:
dict1={'Name':['Ram','Sita','Laxman',None],
      'Age':[30,31,None,33],
      'City':[None,'Hyd','Pune','Chennai']}

pd.DataFrame(dict1)

     Name   Age     City
0     Ram  30.0     None
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3    None  33.0  Chennai

In [4]:
dict1={'Name':['Ram','Sita','Laxman',"Null"],
      'Age':[30,31,"Null",33],
      'City':["Null",'Hyd','Pune','Chennai']}

pd.DataFrame(dict1)

     Name   Age     City
0     Ram    30     Null
1    Sita    31      Hyd
2  Laxman  Null     Pune
3    Null    33  Chennai

In [5]:
# Recommended
dict1={'Name':['Ram','Sita','Laxman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}

df=pd.DataFrame(dict1)
df

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

$Method-1$:
    
**Fill with a random number to all Null values**

In [6]:
df.isnull()

    Name    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [11]:
df.isnull().sum().count()

3

In [10]:
df.isna()

    Name    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

$fillna$

In [15]:
df.fillna(40,inplace=True)

In [16]:
df

     Name   Age     City
0     Ram  30.0       40
1    Sita  31.0      Hyd
2  Laxman  40.0     Pune
3      40  33.0  Chennai

In [17]:
df.dtypes

Name     object
Age     float64
City     object
dtype: object

$Method-2$

**Fill the random value by using column wise**

In [18]:
###################### Read the data again ##########################
dict1={'Name':['Ram','Sita','Laxman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}

df=pd.DataFrame(dict1)
df

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [20]:
df['Name'].fillna("Raheem",inplace=True)
df['Age'].fillna(32,inplace=True) # based on data type
df['City'].fillna("Blr",inplace=True)
df

     Name   Age     City
0     Ram  30.0      Blr
1    Sita  31.0      Hyd
2  Laxman  32.0     Pune
3  Raheem  33.0  Chennai

$Method-3$

- pad

- bfill

- backfill

- ffill

In [21]:
################## Read the data again #################
dict1={'Name':['Ram','Sita','Laxman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}

df=pd.DataFrame(dict1)
df

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [24]:
print("========original===========")
print(df)

print("======pad===========")
print(df.fillna(method='pad'))

print("======ffill===========")
print(df.fillna(method='ffill'))

print("======bfill===========")
print(df.fillna(method='bfill'))

print("======backfill===========")
print(df.fillna(method='backfill'))

========original===========
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai
======pad===========
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman  31.0     Pune
3  Laxman  33.0  Chennai
======ffill===========
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman  31.0     Pune
3  Laxman  33.0  Chennai
======bfill===========
     Name   Age     City
0     Ram  30.0      Hyd
1    Sita  31.0      Hyd
2  Laxman  33.0     Pune
3     NaN  33.0  Chennai
======backfill===========
     Name   Age     City
0     Ram  30.0      Hyd
1    Sita  31.0      Hyd
2  Laxman  33.0     Pune
3     NaN  33.0  Chennai

In [25]:
print("========original===========")
print(df)

print("======pad===========")
print(df.fillna(method='pad'))

print("======pad===========")
print(df.fillna(method='pad',axis=1))

========original===========
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai
======pad===========
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman  31.0     Pune
3  Laxman  33.0  Chennai
======pad===========
     Name     Age     City
0     Ram    30.0     30.0
1    Sita    31.0      Hyd
2  Laxman  Laxman     Pune
3     NaN    33.0  Chennai

In [ ]:
# KNN imputer

$Method-4$:
    
- Mean

- Median

- Mode

In [31]:
################## Read the data agian#####################
dict1={'Name':['Ram','Sita','Laxman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}

df=pd.DataFrame(dict1)
df

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [32]:
mean_age=df['Age'].mean()
df['Age'].fillna(mean_age)

0    30.000000
1    31.000000
2    31.333333
3    33.000000
Name: Age, dtype: float64

In [33]:
median_age=df['Age'].median()
df['Age'].fillna(median_age)

0    30.0
1    31.0
2    31.0
3    33.0
Name: Age, dtype: float64

- Mode is used for categorical data

- Mean and median is used for numerical data